balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ32GS608.PIC
        <edc:SFRDef edc:access="nnnnnnn----nnnnn" edc:cname="IFS1" edc:desc="" edc:impl="0x20db" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000----00000" edc:name="IFS1" edc:nzwidth="0x10" edc:por="0000000----00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SI2C1IF" edc:desc="" edc:mask="0x1" edc:name="SI2C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C1IF" edc:desc="" edc:mask="0x1" edc:name="MI2C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC1IF" edc:desc="" edc:mask="0x1" edc:name="AC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNIF" edc:desc="" edc:mask="0x1" edc:name="CNIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OC3IF" edc:desc="" edc:mask="0x1" edc:name="OC3IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OC4IF" edc:desc="" edc:mask="0x1" edc:name="OC4IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4IF" edc:desc="" edc:mask="0x1" edc:name="T4IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5IF" edc:desc="" edc:mask="0x1" edc:name="T5IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nn---nn" edc:cname="IFS2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------00---00" edc:name="IFS2" edc:nzwidth="16" edc:por="---------00---00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI2IF" edc:desc="" edc:mask="0x1" edc:name="SPI2IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC3IF" edc:desc="" edc:mask="0x1" edc:name="IC3IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC4IF" edc:desc="" edc:mask="0x1" edc:name="IC4IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nn--nn--nn-" edc:cname="IFS3" edc:desc="" edc:impl="0x602" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00--00--00-" edc:name="IFS3" edc:nzwidth="0x10" edc:por="-----00--00--00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SI2C2IF" edc:desc="" edc:mask="0x1" edc:name="SI2C2IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MI2C2IF" edc:desc="" edc:mask="0x1" edc:name="MI2C2IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="INT3IF" edc:desc="" edc:mask="0x1" edc:name="INT3IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4IF" edc:desc="" edc:mask="0x1" edc:name="INT4IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PSEMIF" edc:desc="" edc:mask="0x1" edc:name="PSEMIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEI1IF" edc:desc="" edc:mask="0x1" edc:name="QEI1IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n-n------nn-" edc:cname="IFS4" edc:desc="" edc:impl="0x602" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0-0------00-" edc:name="IFS4" edc:nzwidth="0x10" edc:por="----0-0------00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PSESMIF" edc:desc="" edc:mask="0x1" edc:name="PSESMIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="QEI2IF" edc:desc="" edc:mask="0x1" edc:name="QEI2IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----------n-" edc:cname="IFS5" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----------0-" edc:name="IFS5" edc:nzwidth="0x10" edc:por="000-----------0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP8IF" edc:desc="" edc:mask="0x1" edc:name="ADCP8IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="ADCP12IF" edc:desc="" edc:mask="0x1" edc:name="ADCP12IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1IF" edc:desc="" edc:mask="0x1" edc:name="PWM1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IF" edc:desc="" edc:mask="0x1" edc:name="PWM2IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nnn-nnnnnn" edc:cname="IFS6" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----000-000000" edc:name="IFS6" edc:nzwidth="0x10" edc:por="00----000-000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM3IF" edc:desc="" edc:mask="0x1" edc:name="PWM3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM4IF" edc:desc="" edc:mask="0x1" edc:name="PWM4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM5IF" edc:desc="" edc:mask="0x1" edc:name="PWM5IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6IF" edc:desc="" edc:mask="0x1" edc:name="PWM6IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM7IF" edc:desc="" edc:mask="0x1" edc:name="PWM7IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM8IF" edc:desc="" edc:mask="0x1" edc:name="PWM8IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AC2IF" edc:desc="" edc:mask="0x1" edc:name="AC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC3IF" edc:desc="" edc:mask="0x1" edc:name="AC3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC4IF" edc:desc="" edc:mask="0x1" edc:name="AC4IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ADCP0IF" edc:desc="" edc:mask="0x1" edc:name="ADCP0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP1IF" edc:desc="" edc:mask="0x1" edc:name="ADCP1IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="IFS7" edc:desc="" edc:impl="0x20db" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000" edc:name="IFS7" edc:nzwidth="0x10" edc:por="----------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCP2IF" edc:desc="" edc:mask="0x1" edc:name="ADCP2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP3IF" edc:desc="" edc:mask="0x1" edc:name="ADCP3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP4IF" edc:desc="" edc:mask="0x1" edc:name="ADCP4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP5IF" edc:desc="" edc:mask="0x1" edc:name="ADCP5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP6IF" edc:desc="" edc:mask="0x1" edc:name="ADCP6IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP7IF" edc:desc="" edc:mask="0x1" edc:name="ADCP7IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
