balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ32GS608.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCPC0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADCPC0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSRC0" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC0" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG0" edc:desc="" edc:mask="0x1" edc:name="SWTRG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND0" edc:desc="" edc:mask="0x1" edc:name="PEND0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN0" edc:desc="" edc:mask="0x1" edc:name="IRQEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC1" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC1" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG1" edc:desc="" edc:mask="0x1" edc:name="SWTRG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND1" edc:desc="" edc:mask="0x1" edc:name="PEND1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN1" edc:desc="" edc:mask="0x1" edc:name="IRQEN1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSRC00" edc:desc="" edc:mask="0x1" edc:name="TRGSRC00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC01" edc:desc="" edc:mask="0x1" edc:name="TRGSRC01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC02" edc:desc="" edc:mask="0x1" edc:name="TRGSRC02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC03" edc:desc="" edc:mask="0x1" edc:name="TRGSRC03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC04" edc:desc="" edc:mask="0x1" edc:name="TRGSRC04" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRGSRC10" edc:desc="" edc:mask="0x1" edc:name="TRGSRC10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC11" edc:desc="" edc:mask="0x1" edc:name="TRGSRC11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC12" edc:desc="" edc:mask="0x1" edc:name="TRGSRC12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC13" edc:desc="" edc:mask="0x1" edc:name="TRGSRC13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC14" edc:desc="" edc:mask="0x1" edc:name="TRGSRC14" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCPC1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADCPC1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSRC2" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC2" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG2" edc:desc="" edc:mask="0x1" edc:name="SWTRG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND2" edc:desc="" edc:mask="0x1" edc:name="PEND2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN2" edc:desc="" edc:mask="0x1" edc:name="IRQEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC3" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC3" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG3" edc:desc="" edc:mask="0x1" edc:name="SWTRG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND3" edc:desc="" edc:mask="0x1" edc:name="PEND3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN3" edc:desc="" edc:mask="0x1" edc:name="IRQEN3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSRC20" edc:desc="" edc:mask="0x1" edc:name="TRGSRC20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC21" edc:desc="" edc:mask="0x1" edc:name="TRGSRC21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC22" edc:desc="" edc:mask="0x1" edc:name="TRGSRC22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC23" edc:desc="" edc:mask="0x1" edc:name="TRGSRC23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC24" edc:desc="" edc:mask="0x1" edc:name="TRGSRC24" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRGSRC30" edc:desc="" edc:mask="0x1" edc:name="TRGSRC30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC31" edc:desc="" edc:mask="0x1" edc:name="TRGSRC31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC32" edc:desc="" edc:mask="0x1" edc:name="TRGSRC32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC33" edc:desc="" edc:mask="0x1" edc:name="TRGSRC33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC34" edc:desc="" edc:mask="0x1" edc:name="TRGSRC34" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCPC2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADCPC2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSRC4" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC4" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG4" edc:desc="" edc:mask="0x1" edc:name="SWTRG4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND4" edc:desc="" edc:mask="0x1" edc:name="PEND4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN4" edc:desc="" edc:mask="0x1" edc:name="IRQEN4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC5" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC5" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG5" edc:desc="" edc:mask="0x1" edc:name="SWTRG5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND5" edc:desc="" edc:mask="0x1" edc:name="PEND5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN5" edc:desc="" edc:mask="0x1" edc:name="IRQEN5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSRC40" edc:desc="" edc:mask="0x1" edc:name="TRGSRC40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC41" edc:desc="" edc:mask="0x1" edc:name="TRGSRC41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC42" edc:desc="" edc:mask="0x1" edc:name="TRGSRC42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC43" edc:desc="" edc:mask="0x1" edc:name="TRGSRC43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC44" edc:desc="" edc:mask="0x1" edc:name="TRGSRC44" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRGSRC50" edc:desc="" edc:mask="0x1" edc:name="TRGSRC50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC51" edc:desc="" edc:mask="0x1" edc:name="TRGSRC51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC52" edc:desc="" edc:mask="0x1" edc:name="TRGSRC52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC53" edc:desc="" edc:mask="0x1" edc:name="TRGSRC53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC54" edc:desc="" edc:mask="0x1" edc:name="TRGSRC54" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
