balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ32GS608.PIC
        <edc:SFRDef edc:access="nnnnnnnnnn-nnnnn" edc:cname="CLKDIV" edc:desc="" edc:impl="0xffdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0011000001-00000" edc:name="CLKDIV" edc:nzwidth="0x10" edc:por="0011000001-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLLPRE" edc:desc="" edc:mask="0x1f" edc:name="PLLPRE" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PLLPOST" edc:desc="" edc:mask="0x3" edc:name="PLLPOST" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FRCDIV" edc:desc="" edc:mask="0x7" edc:name="FRCDIV" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DOZEN" edc:desc="" edc:mask="0x1" edc:name="DOZEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOZE" edc:desc="" edc:mask="0x7" edc:name="DOZE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ROI" edc:desc="" edc:mask="0x1" edc:name="ROI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLLPRE0" edc:desc="" edc:mask="0x1" edc:name="PLLPRE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLPRE1" edc:desc="" edc:mask="0x1" edc:name="PLLPRE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLPRE2" edc:desc="" edc:mask="0x1" edc:name="PLLPRE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLPRE3" edc:desc="" edc:mask="0x1" edc:name="PLLPRE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLPRE4" edc:desc="" edc:mask="0x1" edc:name="PLLPRE4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PLLPOST0" edc:desc="" edc:mask="0x1" edc:name="PLLPOST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLPOST1" edc:desc="" edc:mask="0x1" edc:name="PLLPOST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FRCDIV0" edc:desc="" edc:mask="0x1" edc:name="FRCDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FRCDIV1" edc:desc="" edc:mask="0x1" edc:name="FRCDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FRCDIV2" edc:desc="" edc:mask="0x1" edc:name="FRCDIV2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DOZE0" edc:desc="" edc:mask="0x1" edc:name="DOZE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DOZE1" edc:desc="" edc:mask="0x1" edc:name="DOZE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DOZE2" edc:desc="" edc:mask="0x1" edc:name="DOZE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------nnnnnnnnn" edc:cname="PLLFBD" edc:desc="" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000110000" edc:name="PLLFBD" edc:nzwidth="0x10" edc:por="-------000110000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLLDIV" edc:desc="" edc:mask="0x1ff" edc:name="PLLDIV" edc:nzwidth="0x9"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLLDIV0" edc:desc="" edc:mask="0x1" edc:name="PLLDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV1" edc:desc="" edc:mask="0x1" edc:name="PLLDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV2" edc:desc="" edc:mask="0x1" edc:name="PLLDIV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV3" edc:desc="" edc:mask="0x1" edc:name="PLLDIV3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV4" edc:desc="" edc:mask="0x1" edc:name="PLLDIV4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV5" edc:desc="" edc:mask="0x1" edc:name="PLLDIV5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV6" edc:desc="" edc:mask="0x1" edc:name="PLLDIV6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV7" edc:desc="" edc:mask="0x1" edc:name="PLLDIV7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV8" edc:desc="" edc:mask="0x1" edc:name="PLLDIV8" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="OSCTUN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000" edc:name="OSCTUN" edc:nzwidth="0x10" edc:por="----------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x3f" edc:name="TUN" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:AdjustPoint edc:offset="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:desc="" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:desc="" edc:mask="0x1" edc:name="TUN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:desc="" edc:mask="0x1" edc:name="TUN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:desc="" edc:mask="0x1" edc:name="TUN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ10" edc:desc="" edc:mask="0x1" edc:name="TSEQ10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ11" edc:desc="" edc:mask="0x1" edc:name="TSEQ11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ12" edc:desc="" edc:mask="0x1" edc:name="TSEQ12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ13" edc:desc="" edc:mask="0x1" edc:name="TSEQ13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ20" edc:desc="" edc:mask="0x1" edc:name="TSEQ20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ21" edc:desc="" edc:mask="0x1" edc:name="TSEQ21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ22" edc:desc="" edc:mask="0x1" edc:name="TSEQ22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ23" edc:desc="" edc:mask="0x1" edc:name="TSEQ23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ30" edc:desc="" edc:mask="0x1" edc:name="TSEQ30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ31" edc:desc="" edc:mask="0x1" edc:name="TSEQ31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ32" edc:desc="" edc:mask="0x1" edc:name="TSEQ32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ33" edc:desc="" edc:mask="0x1" edc:name="TSEQ33" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
